# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy  as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [55]:
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'
baby_names = pd.read_csv(url)

### Step 4. See the first 10 entries

In [56]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [57]:
baby_names.drop(['Unnamed: 0', 'Id'], axis = 1, inplace = True)

### Step 6. Is there more male or female names in the dataset?

In [58]:
df = baby_names.groupby(['Gender']).agg({'Name' : 'count'}).sort_values(by = 'Name', ascending = False)
df.iloc[0,:]

Name    558846
Name: F, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [59]:
names = baby_names.groupby('Name').size().reset_index(name='Count')
names.sort_values(by = 'Count', ascending = False).head()

         Name  Count
14062   Riley   1112
2174    Avery   1080
8500   Jordan   1073
13459  Peyton   1064
6584   Hayden   1049

### Step 8. How many different names exist in the dataset?

In [60]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [61]:
condition = names['Count'] == names['Count'].max()
names[condition]

        Name  Count
14062  Riley   1112

### Step 10. How many different names have the least occurrences?

In [62]:
condition = names['Count'] == names['Count'].min()
len(names[condition])

3682

### Step 11. What is the median name occurrence?

In [63]:
condition = names.Count == names.Count.median()
names[condition]

           Name  Count
196    Abubakar      8
290      Adelie      8
326       Adira      8
384     Adylene      8
395      Aerial      8
...         ...    ...
17336    Zamaya      8
17352    Zanaya      8
17377      Zari      8
17425    Zaylie      8
17596    Zyanna      8

[360 rows x 2 columns]

### Step 12. What is the standard deviation of names?

In [64]:
names.Count.std()

122.0299635081389

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [65]:
names.describe()

              Count
count  17632.000000
mean      57.644907
std      122.029964
min        1.000000
25%        2.000000
50%        8.000000
75%       39.000000
max     1112.000000